docs/apis/for-buyers/legacy-pull-buyers-api/booking-management/cancel.mdx

---
sidebar_position: 4
title: Cancel
---

:::danger Deprecated API

The Legacy Pull Buyers API, our initial Buyers API launched in 2012, is now deprecated and should not be further developed. Instead, we introduced the [Hotel-X Buyers API](/docs/apis/for-buyers/hotel-x-pull-buyers-api/quickstart) in 2017, which serves as the sole API for new Buyers looking to integrate and participate in our Marketplace.

:::

# Cancel

The Cancel operation allows you to cancel a booking made via Travelgate. The returned fields include: `ProviderLocator`, `CancelId`, `TransactionStatus`, `Price` etc.

:::caution

The amount of information returned might vary between Sellers.

:::

## Cancel Request

```xml
<soapenv:Envelope xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns = "http://schemas.xmltravelgate.com/hub/2012/06" xmlns:wsse = "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
   <soapenv:Header>
      <wsse:Security>
         <wsse:UsernameToken>
            <wsse:Username>username</wsse:Username>
            <wsse:Password>password</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ns:Cancel>
         <ns:cancelRQ>
            <ns:timeoutMilliseconds>20000</ns:timeoutMilliseconds>
            <ns:version>1</ns:version>
            <ns:providerRQ>
               <ns:code>suppliercode</ns:code>
               <ns:id>1</ns:id>
               <ns:rqXML>
                  <CancelRQ xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd = "http://www.w3.org/2001/XMLSchema" hotelCode = "">
                      <timeoutMilliseconds>19700</timeoutMilliseconds>
                     <source>
                        <languageCode>en</languageCode>
                     </source>
                     <filterAuditData>
                        <registerTransactions>true</registerTransactions>
                     </filterAuditData>
                     <Configuration>
                        <User>user</User>
                        <Password>password</Password>
                        <UrlAvail>www.supplier.com/avail</UrlAvail>
                        <UrlReservation>www.supplier.com/reservation</UrlReservation>
                        <UrlValuation>www.supplier.com/valuation</UrlValuation>
                        <UrlGeneric>www.supplier.com/generic</UrlGeneric>
                        <Parameters>
                           <Parameter key = "UrlListHotels" value = "http://www.supplier.com/ListHotels"></Parameter>
                           <Parameter key = "Access" value = "22334"></Parameter>
                        </Parameters>
                     </Configuration>
                     <Locators>
                        <Client>XXXXXXX</Client>
                        <Provider>XXXXXXX</Provider>
                        <Property>XXXXXXX</Property>
                     </Locators>
                     <StartDate>28/11/2014</StartDate>
                     <EndDate>28/11/2014</EndDate>
                     <Holder title = "Miss" name = "Test11" surname = "TestAp11"/>
                  </CancelRQ>
               </ns:rqXML>
            </ns:providerRQ>
         </ns:cancelRQ>
      </ns:Cancel>
   </soapenv:Body>
</soapenv:Envelope>
```

### Request Data Breakdown

:::info

Check the values you need to add in the [header](/docs/apis/for-buyers/legacy-pull-buyers-api/making-requests/request-headers) and [common elements](/docs/apis/for-buyers/legacy-pull-buyers-api/making-requests/common-elements).

:::

| **Element**			| **Number**	| **Type**	| **Description**					|
| ----------------------------- | ------------- | ------------- | ----------------------------------------------------- |
| CancelRQ   			| 1          	|		| Root node.						|
| @hotelCode 			| 1    		| String	| Hotel code.						|
| CancelRQ/Locators		| 1          	|		| Locator Information (it's mandatory to indicate either the client or supplier's).	|
| Locators/Client		| 0..1 		| String	| Client locator.					|
| Locators/Provider	| 0..1 		| String	| Supplier locator.					|
| Locators/Property		| 0..1 		| String	| Property locator (see [MetaData](/docs/apis/for-buyers/legacy-pull-buyers-api/content/meta-data) method in order to verify if the supplier implements it).				|
| CancelRQ/StartDate  			| 1    		| String	| Start date of booking.				|
| CancelRQ/EndDate    			| 1    		| String	| End date of booking.					|
| CancelRQ/Holder   				| 0..1		|		| Holder of the booking.  |
| @title   				| 1		| String	| Holder’s title. Possible values: Mr, Mrs, Miss, Ms  |
| @name   				| 1		|	String	| Holder's name.  |
| @surname   				| 1		|	String	| Holder's surname.  |

## Cancel Response

After each request, the Seller will process the data and provide you with a response. Upon receiving a `Cancel` request, the Seller will send you a corresponding `Cancel` response. 

The response options include either **success** or an **error**. In the event of success, you will receive the transaction status.

### Success

```xml
<CancelRS>
   <ProviderLocator>YYYYYYYY</ProviderLocator> 
   <CancelId>0000000</CancelId>
   <TransactionStatus>
      <ComunicationStatus>OK</ComunicationStatus>
      <RSStatus>EXISTE</RSStatus>
      <ResStatus>CN</ResStatus>
   </TransactionStatus>
   <Price  currency="EUR" amount="120.5" binding="false" commission="-1" minimumSellingPrice="-1"/>
</CancelRS>
```

#### Success Response Data Breakdown

| Element				| Rel	| Type	| Description						|
| ------------------------------------- | ------------- | ------------- | ------------------------------------------------------------- |
| CancelRS   				| 1          	|		| Root node.							|
| CancelRS/ProviderLocator			| 1    		| String	| Supplier locator.						|
| CancelRS/CancelId   				| 0..1 		| String	| Cancellation id.  						|
| CancelRS/TransactionStatus		| 1          	|		| Transaction Status.						|
| TransactionStatus/ComunicationStatus	| 1    		| String	| Status communication (OFFLINE, OK and KO).			|
| TransactionStatus/RSStatus		| 1    		| String	| <details>     <summary>Response Status</summary>     <div>         <div>          <table>  				 <thead>  					 <tr>  						 <th>  							 <strong>Status</strong>  						 </th>  						 <th>  							 <strong>Description</strong>  						 </th>  					 </tr>  				 </thead>  				 <tbody>  					 <tr>  						 <td>DESCONOCIDO</td>  						 <td>Unknown</td>  					 </tr>  					 <tr>  						 <td>EXISTE</td>  						 <td>Exists</td>  					 </tr>           <tr>  						 <td>EXISTECANCELADA</td>  						 <td>exists but it's cancelled</td>  					 </tr>				 <tr>  						 <td>NO_EXISTE</td>  						 <td>Does not exist</td>  					 </tr>       </tbody>  			</table>         </div>     </div> </details>	|
| TransactionStatus/ResStatus		| 1    		| String	| <details>     <summary>Reservation Status</summary>     <div>         <div>          <table>  				 <thead>  					 <tr>  						 <th>  							 <strong>Status Code</strong>  						 </th>  						 <th>  							 <strong>Description</strong>  						 </th>  					 </tr>  				 </thead>  				 <tbody>  					 <tr>  						 <td>OK</td>  						 <td>The reservation was completed with no problems.</td>  					 </tr>  					 <tr>  						 <td>RQ</td>  						 <td>The reservation was completed but the product is still not available, so the reservation goes into a waiting list (Request).</td>  					 </tr>           <tr>  						 <td>CN</td>  						 <td>The reservation was completed but due to a supplier error or a timeout the system will immediately cancel the reservation to prevent further possible errors.</td>  					 </tr>				 <tr>  						 <td>UN</td>  						 <td>The reservation was completed but due to a supplier error or a timeout, the reservation status is unknown. It is the client’s responsibility to check if the booking is OK.</td>  					 </tr>       </tbody>  			</table>         </div>     </div> </details>	|
| CancelRS/Price      				| 0..1      |	Decimal	| Fee for the cancellation. (see [MetaData](../content/meta-data/) in order to verify if supplier informs of it).						|
| @currency  				| 1    		| String	| Currency code (Our system uses a standard ISO - 3 for all suppliers).	 						|
| @amount    				| 1    		| Decimal	| Amount.  						|
| @binding   				| 1    		| Boolean	| If binding is set as true, then the client can’t sell the product for a lower price that the one set by the supplier. If it set as as false, the client can sell the product for a lower price. |
| @commission				| 1    		| Decimal	| <details>     <summary>Commission Scenarios</summary>     <div>         <div>          <table>  				 <thead>  					 <tr>  						 <th>  							 <strong>Commission</strong>  						 </th>  						 <th>  							 <strong>Description</strong>  						 </th>  					 </tr>  				 </thead>  				 <tbody>  					 <tr>  						 <td>0</td>  						 <td>The price returned is net.</td>  					 </tr>  					 <tr>  						 <td>-1</td>  						 <td>The supplier has not supplied the sale price nor the commission. This information is in the commercial contract with the supplier.</td>  					 </tr>           <tr>  						 <td>Greater than 0</td>  						 <td>X = % of the commission applied to the amount.</td>  					 </tr>				 </tbody>  			</table>         </div>     </div> </details>	|
| @minimumSellingPrice 				   | 1 		    | Decimal 	    | Indicates the minimum selling price it can be sold (determined by the Seller). If is specified (different than "-1"), that field takes preference to amount.		<details>     <summary>Minimum Selling Price Scenarios</summary>     <div>         <div>          <table>  				 <thead>  					 <tr>  						 <th>  							 <strong>Minimum Selling Price</strong>  						 </th>  						 <th>  							 <strong>Description</strong>  						 </th>  					 </tr>  				 </thead>  				 <tbody> <tr>  						 <td>0</td>  						 <td>No minimum selling price is provided.</td>  					 </tr>       <tr>  						 <td>-1</td>  						 <td>We have no information about MSP from the Seller.</td>  					 </tr>     <tr>  						 <td>Greater than 0</td>  						 <td>The lowest possible amount that can be sold commercially.</td>  					 </tr>				 </tbody>  			</table>         </div>     </div> </details> |

### Error

```xml
<CancelRS>
   <operationImplemented>true</operationImplemented>
   <applicationError>
      <code/>
      <type>105</type>
      <description>Communication Error.</description>
      <httpStatusCode>0</httpStatusCode>
   </applicationError>
</CancelRS>
```

<details>
    <summary>Error codes that will be included in the response in the event of an error</summary>
    <div>
        <div>
         <table>
				<thead>
					<tr>
						<th>
							<strong>Error Code</strong>
						</th>
						<th>
							<strong>Error Description</strong>
						</th>
					</tr>
				</thead>
				<tbody>
					<tr>
						<td>101</td>
						<td>System Exception (Exception not controlled or not classified as general exception).</td>
					</tr>
					<tr>
						<td>102</td>
						<td>Supplier Error.</td>
					</tr>
					<tr>
						<td>103</td>
						<td>Too many requests to the supplier.</td>
					</tr>
               <tr>
						<td>104</td>
						<td>Timeout (Timeout during the execution of an operation (look in the common attribute timeout )).</td>
					</tr>
					<tr>
						<td>105</td>
						<td>Communication Error.</td>
					</tr>
					<tr>
						<td>204</td>
						<td>Supplier returns 0 results in availability.</td>
					</tr>
                    <tr>
						<td>205</td>
						<td>The Supplier doesn’t accept the distribution RQ.</td>
					</tr>
					<tr>
						<td>206</td>
						<td>The Supplier doesn’t accept the dates RQ.</td>
					</tr>
					<tr>
						<td>207</td>
						<td>The Supplier doesn’t accept the request RQ.</td>
					</tr>
               <tr>
						<td>301</td>
						<td>Option not found in policies.</td>
					</tr>
               <tr>
						<td>302</td>
						<td>Hotel Not Found in DescriptiveInfo.</td>
					</tr>
               <tr>
						<td>303</td>
						<td>Booking not confirmed in the supplier’s system.</td>
					</tr>
				</tbody>
			</table>
        </div>
    </div>
</details>
